Revit 2027 API
ElementLevelFilter(ElementId) Constructor
 Constructs a new instance of an ElementLevelFilter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementLevelFilter(
	ElementId levelId
)
Public Sub New (
	levelId As ElementId
)
public:
ElementLevelFilter(
	ElementId^ levelId
)
new :
        levelId : ElementId -> ElementLevelFilter
Parameters
levelId ElementId
 The id of the level that will be matched to elements' associated level.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementLevelFilter Class
ElementLevelFilter Overload
Autodesk.Revit.DB Namespace